In [1]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('telco.db')
cursor = conn.cursor()

# 1. ‡∏™‡∏£‡πâ‡∏≤‡∏á‡∏ï‡∏≤‡∏£‡∏≤‡∏á‡πÅ‡∏û‡πá‡∏Å‡πÄ‡∏Å‡∏à (Packages)
cursor.execute('''CREATE TABLE IF NOT EXISTS packages (
    package_id INTEGER PRIMARY KEY,
    package_name TEXT,
    price INTEGER)''')

# 2. ‡∏™‡∏£‡πâ‡∏≤‡∏á‡∏ï‡∏≤‡∏£‡∏≤‡∏á‡∏•‡∏π‡∏Å‡∏Ñ‡πâ‡∏≤ (Subscribers)
cursor.execute('''CREATE TABLE IF NOT EXISTS subscribers (
    sub_id INTEGER PRIMARY KEY,
    name TEXT,
    package_id INTEGER)''')

# 3. ‡∏™‡∏£‡πâ‡∏≤‡∏á‡∏ï‡∏≤‡∏£‡∏≤‡∏á‡∏Å‡∏≤‡∏£‡πÉ‡∏ä‡πâ‡∏á‡∏≤‡∏ô‡πÄ‡∏ô‡πá‡∏ï (Data_Usage) - ‡∏ö‡∏±‡∏ô‡∏ó‡∏∂‡∏Å‡∏Å‡∏≤‡∏£‡πÉ‡∏ä‡πâ‡∏£‡∏≤‡∏¢‡∏ß‡∏±‡∏ô
cursor.execute('''CREATE TABLE IF NOT EXISTS data_usage (
    usage_id INTEGER PRIMARY KEY,
    sub_id INTEGER,
    data_gb REAL)''')

# 4. ‡πÉ‡∏™‡πà‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡∏à‡∏≥‡∏•‡∏≠‡∏á
# ‡πÅ‡∏û‡πá‡∏Å‡πÄ‡∏Å‡∏à: 1=Starter(299), 2=Basic(499), 3=MaxSpeed(899), 4=Unlimited(1099)
cursor.executemany('INSERT INTO packages VALUES (?,?,?)', [
    (1, 'Starter', 299), (2, 'Basic', 499), (3, 'MaxSpeed', 899), (4, 'Unlimited', 1099)])

# ‡∏•‡∏π‡∏Å‡∏Ñ‡πâ‡∏≤
cursor.executemany('INSERT INTO subscribers VALUES (?,?,?)', [
    (101, 'Keng', 1), (102, 'Bum', 1), (103, 'Ann', 2), 
    (104, 'Boy', 3), (105, 'Cat', 1), (106, 'Dan', 4)])

# ‡∏Å‡∏≤‡∏£‡πÉ‡∏ä‡πâ‡∏á‡∏≤‡∏ô‡πÄ‡∏ô‡πá‡∏ï (‡πÉ‡∏Ñ‡∏£‡πÉ‡∏ä‡πâ‡πÄ‡∏¢‡∏≠‡∏∞‡πÜ ‡∏ö‡πâ‡∏≤‡∏á?)
# Keng (‡πÇ‡∏õ‡∏£ 299) ‡πÉ‡∏ä‡πâ‡πÑ‡∏õ 20+35 = 55GB (‡πÄ‡∏õ‡πâ‡∏≤‡∏´‡∏°‡∏≤‡∏¢!)
# Bum (‡πÇ‡∏õ‡∏£ 299) ‡πÉ‡∏ä‡πâ‡πÑ‡∏õ 5+5 = 10GB
# Ann (‡πÇ‡∏õ‡∏£ 499) ‡πÉ‡∏ä‡πâ‡πÑ‡∏õ 40+20 = 60GB (‡πÄ‡∏õ‡πâ‡∏≤‡∏´‡∏°‡∏≤‡∏¢! ‡πÄ‡∏û‡∏£‡∏≤‡∏∞‡∏£‡∏≤‡∏Ñ‡∏≤ < 500)
# Boy (‡πÇ‡∏õ‡∏£ 899) ‡πÉ‡∏ä‡πâ‡πÑ‡∏õ 100GB (‡πÑ‡∏°‡πà‡πÄ‡∏≠‡∏≤ ‡πÄ‡∏û‡∏£‡∏≤‡∏∞‡∏à‡πà‡∏≤‡∏¢‡πÅ‡∏û‡∏á‡∏≠‡∏¢‡∏π‡πà‡πÅ‡∏•‡πâ‡∏ß)
usage_data = [
    (1, 101, 20.5), (2, 101, 35.0), # Keng
    (3, 102, 5.0), (4, 102, 5.0),   # Bum
    (5, 103, 40.0), (6, 103, 20.0), # Ann
    (7, 104, 100.0),                # Boy
    (8, 105, 60.0),                 # Cat (‡πÇ‡∏õ‡∏£ 299, ‡πÉ‡∏ä‡πâ 60GB -> ‡πÄ‡∏õ‡πâ‡∏≤‡∏´‡∏°‡∏≤‡∏¢!)
    (9, 106, 200.0)                 # Dan
]
cursor.executemany('INSERT INTO data_usage VALUES (?,?,?)', usage_data)
conn.commit()
print("‚úÖ ‡∏£‡∏∞‡∏ö‡∏ö Telco Database ‡∏û‡∏£‡πâ‡∏≠‡∏°‡πÉ‡∏ä‡πâ‡∏á‡∏≤‡∏ô!")

‚úÖ ‡∏£‡∏∞‡∏ö‡∏ö Telco Database ‡∏û‡∏£‡πâ‡∏≠‡∏°‡πÉ‡∏ä‡πâ‡∏á‡∏≤‡∏ô!

In [2]:
print("--- 1. ‡∏ï‡∏≤‡∏£‡∏≤‡∏á‡πÅ‡∏û‡πá‡∏Å‡πÄ‡∏Å‡∏à (Packages) ---")
df_packages = pd.read_sql("SELECT * FROM packages", conn)
display(df_packages)

--- 1. ‡∏ï‡∏≤‡∏£‡∏≤‡∏á‡πÅ‡∏û‡πá‡∏Å‡πÄ‡∏Å‡∏à (Packages) ---

   package_id package_name  price
0           1      Starter    299
1           2        Basic    499
2           3     MaxSpeed    899
3           4    Unlimited   1099

In [3]:
print("\n--- 2. ‡∏ï‡∏≤‡∏£‡∏≤‡∏á‡∏•‡∏π‡∏Å‡∏Ñ‡πâ‡∏≤ (Subscribers) ---")
df_subscribers = pd.read_sql("SELECT * FROM subscribers", conn)
display(df_subscribers)

--- 2. ‡∏ï‡∏≤‡∏£‡∏≤‡∏á‡∏•‡∏π‡∏Å‡∏Ñ‡πâ‡∏≤ (Subscribers) ---

   sub_id  name  package_id
0     101  Keng           1
1     102   Bum           1
2     103   Ann           2
3     104   Boy           3
4     105   Cat           1
5     106   Dan           4

In [4]:
print("\n--- 3. ‡∏ï‡∏≤‡∏£‡∏≤‡∏á‡∏Å‡∏≤‡∏£‡πÉ‡∏ä‡πâ‡∏á‡∏≤‡∏ô (Data Usage) ---")
df_usage = pd.read_sql("SELECT * FROM data_usage", conn)
display(df_usage)

--- 3. ‡∏ï‡∏≤‡∏£‡∏≤‡∏á‡∏Å‡∏≤‡∏£‡πÉ‡∏ä‡πâ‡∏á‡∏≤‡∏ô (Data Usage) ---

   usage_id  sub_id  data_gb
0         1     101     20.5
1         2     101     35.0
2         3     102      5.0
3         4     102      5.0
4         5     103     40.0
5         6     103     20.0
6         7     104    100.0
7         8     105     60.0
8         9     106    200.0

In [5]:
#‡∏Ç‡πâ‡∏≠‡∏°‡∏π‡∏•‡πÅ‡∏ö‡∏ö‡πÄ‡∏ä‡∏∑‡πà‡∏≠‡∏°‡∏ï‡∏≤‡∏£‡∏≤‡∏á‡∏î‡∏π‡πÑ‡∏´‡∏°?

In [6]:
print("\n--- üìä ‡∏™‡∏£‡∏∏‡∏õ‡∏¢‡∏≠‡∏î‡∏Å‡∏≤‡∏£‡πÉ‡∏ä‡πâ‡∏á‡∏≤‡∏ô‡∏Ç‡∏≠‡∏á‡πÅ‡∏ï‡πà‡∏•‡∏∞‡∏Ñ‡∏ô (Join Tables) ---")

sql = """
SELECT 
    subscribers.name, 
    packages.package_name, 
    packages.price,
    SUM(data_usage.data_gb) as total_data_gb
FROM subscribers
INNER JOIN packages ON subscribers.package_id = packages.package_id
LEFT JOIN data_usage ON subscribers.sub_id = data_usage.sub_id
GROUP BY subscribers.name
ORDER BY total_data_gb DESC
"""

df_result = pd.read_sql(sql, conn)
display(df_result)

--- üìä ‡∏™‡∏£‡∏∏‡∏õ‡∏¢‡∏≠‡∏î‡∏Å‡∏≤‡∏£‡πÉ‡∏ä‡πâ‡∏á‡∏≤‡∏ô‡∏Ç‡∏≠‡∏á‡πÅ‡∏ï‡πà‡∏•‡∏∞‡∏Ñ‡∏ô (Join Tables) ---

   name package_name  price  total_data_gb
0   Dan    Unlimited   1099          200.0
1   Boy     MaxSpeed    899          100.0
2   Cat      Starter    299           60.0
3   Ann        Basic    499           60.0
4  Keng      Starter    299           55.5
5   Bum      Starter    299           10.0

In [7]:
# ‡πÇ‡∏à‡∏ó‡∏¢‡πå: ‡∏ï‡∏≤‡∏°‡∏´‡∏≤‡∏•‡∏π‡∏Å‡∏Ñ‡πâ‡∏≤‡πÄ‡∏õ‡πâ‡∏≤‡∏´‡∏°‡∏≤‡∏¢ (‡πÉ‡∏ä‡πâ‡πÄ‡∏ô‡πá‡∏ï‡πÄ‡∏¢‡∏≠‡∏∞ > 50GB ‡πÅ‡∏ï‡πà‡∏à‡πà‡∏≤‡∏¢‡∏ô‡πâ‡∏≠‡∏¢ < 500 ‡∏ö‡∏≤‡∏ó)

sql = """
SELECT 
    subscribers.name, 
    packages.package_name, 
    packages.price, 
    SUM(data_usage.data_gb) AS Total_Data_GB
FROM subscribers
INNER JOIN packages ON subscribers.package_id = packages.package_id
INNER JOIN data_usage ON subscribers.sub_id = data_usage.sub_id
WHERE packages.price < 500
GROUP BY subscribers.name
HAVING Total_Data_GB > 50
ORDER BY Total_Data_GB DESC
"""

# ‡∏£‡∏±‡∏ô‡∏ú‡∏•‡∏•‡∏±‡∏û‡∏ò‡πå
df_target = pd.read_sql(sql, conn)
display(df_target)

   name package_name  price  Total_Data_GB
0   Cat      Starter    299           60.0
1   Ann        Basic    499           60.0
2  Keng      Starter    299           55.5